artilleryInfo.txt
{
  "aggregate": {
    "counters": {
      "vusers.created_by_name.0": 50,
      "vusers.created": 50,
      "http.requests": 1000,
      "http.codes.200": 1000,
      "http.responses": 1000,
      "vusers.failed": 0,
      "vusers.completed": 50
    },
    "rates": {
      "http.request_rate": 117
    },
    "firstCounterAt": 1671732679721,
    "firstHistogramAt": 1671732679876,
    "lastCounterAt": 1671732684596,
    "lastHistogramAt": 1671732684596,
    "firstMetricAt": 1671732679721,
    "lastMetricAt": 1671732684596,
    "period": 1671732680000,
    "summaries": {
      "http.response_time": {
        "min": 29,
        "max": 347,
        "count": 1000,
        "p50": 206.5,
        "median": 206.5,
        "p75": 228.2,
        "p90": 267.8,
        "p95": 290.1,
        "p99": 320.6,
        "p999": 327.1
      },
      "vusers.session_length": {
        "min": 3894.3,
        "max": 4454.3,
        "count": 50,
        "p50": 4231.1,
        "median": 4231.1,
        "p75": 4316.6,
        "p90": 4403.8,
        "p95": 4403.8,
        "p99": 4403.8,
        "p999": 4403.8
      }
    },
    "histograms": {
      "http.response_time": {
        "min": 29,
        "max": 347,
        "count": 1000,
        "p50": 206.5,
        "median": 206.5,
        "p75": 228.2,
        "p90": 267.8,
        "p95": 290.1,
        "p99": 320.6,
        "p999": 327.1
      },
      "vusers.session_length": {
        "min": 3894.3,
        "max": 4454.3,
        "count": 50,
        "p50": 4231.1,
        "median": 4231.1,
        "p75": 4316.6,
        "p90": 4403.8,
        "p95": 4403.8,
        "p99": 4403.8,
        "p999": 4403.8
      }
    }
  },
  "intermediate": [
    {
      "counters": {
        "vusers.created_by_name.0": 13,
        "vusers.created": 13,
        "http.requests": 18,
        "http.codes.200": 6,
        "http.responses": 6
      },
      "rates": {
        "http.request_rate": 18
      },
      "http.request_rate": null,
      "firstCounterAt": 1671732679721,
      "firstHistogramAt": 1671732679876,
      "lastCounterAt": 1671732679977,
      "lastHistogramAt": 1671732679977,
      "firstMetricAt": 1671732679721,
      "lastMetricAt": 1671732679977,
      "period": "1671732670000",
      "summaries": {
        "http.response_time": {
          "min": 126,
          "max": 166,
          "count": 6,
          "p50": 133,
          "median": 133,
          "p75": 153,
          "p90": 156,
          "p95": 156,
          "p99": 156,
          "p999": 156
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 126,
          "max": 166,
          "count": 6,
          "p50": 133,
          "median": 133,
          "p75": 153,
          "p90": 156,
          "p95": 156,
          "p99": 156,
          "p999": 156
        }
      }
    },
    {
      "counters": {
        "http.requests": 982,
        "vusers.created_by_name.0": 37,
        "vusers.created": 37,
        "http.codes.200": 994,
        "http.responses": 994,
        "vusers.failed": 0,
        "vusers.completed": 50
      },
      "rates": {
        "http.request_rate": 215
      },
      "http.request_rate": null,
      "firstCounterAt": 1671732680003,
      "firstHistogramAt": 1671732680005,
      "lastCounterAt": 1671732684596,
      "lastHistogramAt": 1671732684596,
      "firstMetricAt": 1671732680003,
      "lastMetricAt": 1671732684596,
      "period": "1671732680000",
      "summaries": {
        "http.response_time": {
          "min": 29,
          "max": 347,
          "count": 994,
          "p50": 206.5,
          "median": 206.5,
          "p75": 228.2,
          "p90": 267.8,
          "p95": 290.1,
          "p99": 320.6,
          "p999": 327.1
        },
        "vusers.session_length": {
          "min": 3894.3,
          "max": 4454.3,
          "count": 50,
          "p50": 4231.1,
          "median": 4231.1,
          "p75": 4316.6,
          "p90": 4403.8,
          "p95": 4403.8,
          "p99": 4403.8,
          "p999": 4403.8
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 29,
          "max": 347,
          "count": 994,
          "p50": 206.5,
          "median": 206.5,
          "p75": 228.2,
          "p90": 267.8,
          "p95": 290.1,
          "p99": 320.6,
          "p999": 327.1
        },
        "vusers.session_length": {
          "min": 3894.3,
          "max": 4454.3,
          "count": 50,
          "p50": 4231.1,
          "median": 4231.1,
          "p75": 4316.6,
          "p90": 4403.8,
          "p95": 4403.8,
          "p99": 4403.8,
          "p999": 4403.8
        }
      }
    }
  ]
}